[
  "What subjects or classes do you enjoy the most in school, and why do you like them?",
  "Outside of school, what activities or hobbies do you love to do, and what do you enjoy about them?",
  "Which subjects or tasks do you find easiest or do well in, and which ones are more challenging or less interesting to you?",
  "What are some skills or personal strengths you feel you have? (For example, you might be good at explaining things, creative arts, solving math problems, being a good listener, leading a team, etc.)",
  "What things are most important to you in a future career? (For example, helping others, being creative, earning a good income, having job stability, working on something new, etc.)",
  "Do you prefer working more with people, with computers/technology, with art/creative work, with numbers/data, or with nature/outdoors? Why do you feel that way?",
  "What kind of work environment do you think you would enjoy? (For example: working in an office, traveling for work, being outdoors, in a lab, or a mix of these.)",
  "Do you usually like to work on your own or as part of a team, and why?",
  "What is a dream or big goal you have for your future? (This could be something you hope to achieve or become one day.)",
  "Is there a particular career or field you have heard about that sounds interesting to you? What about it interests you?",
  "Is there someone (like a family member, teacher, or famous person) whose career or work you really admire? What do you find inspiring about what they do?",
  "What kind of career do your parents or family members encourage you to pursue, and how do you feel about their expectations or suggestions?",
  "In India, students often choose a stream (Science, Commerce, or Arts) in Class 11. Which stream have you chosen or are you thinking of choosing, and why does that stream interest you?",
  "Have you ever thought about studying or working in another country in the future, or do you see yourself building your career in India? Why do you feel that way?",
  "What sounds more appealing to you: following a well-known career path (for example, engineer, doctor, or a government job) or exploring a newer, less common field (for example, animation, environmental science, starting your own business), and why?",
  "Imagine yourself when you are about 25 years old: what do you see yourself doing at that age (for example, what kind of work or further studies might you be doing, and how do you imagine your life)?",
  "Based on all your answers, what is one step you would like to take next to explore or move towards a career path that interests you?"
]
